app/controllers/quiz_bs_controller.rb

  def show
    @quiz_bs = QuizBs.find(params[:id])
---
SELECT  "quiz_bs".* FROM "quiz_bs" WHERE "quiz_bs"."id" = ? LIMIT 1  [["id", 0]]

  def create
    @quiz_bs = QuizBs.new

    @quiz_bs.bs01 = params[:quiz_bs][:bs01]
    @quiz_bs.bs02 = params[:quiz_bs][:bs02]
    @quiz_bs.bs03 = params[:quiz_bs][:bs03]
    @quiz_bs.bs04 = params[:quiz_bs][:bs04]
    @quiz_bs.bs05 = params[:quiz_bs][:bs05]
    @quiz_bs.bs06 = params[:quiz_bs][:bs06]

    @quiz_bs.user = current_user

    if @quiz_bs.save
---
INSERT INTO "quiz_bs" ("bs01", "bs02", "bs03", "bs04", "bs05", "bs06", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)  [["bs01", 1], ["bs02", 1], ["bs03", 1], ["bs04", 1], ["bs05", 1], ["bs06", 1], ["user_id", 1], ["created_at", "2016-04-27 03:18:20.155013"], ["updated_at", "2016-04-27 03:18:20.155013"]]

  def edit
    @quiz_bs = QuizBs.find(params[:id])
---
SELECT  "quiz_bs".* FROM "quiz_bs" WHERE "quiz_bs"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @quiz_bs = QuizBs.find(params[:id])

    @quiz_bs.assign_attributes(quiz_bs_params)

    if @quiz_bs.save
---
SELECT  "quiz_bs".* FROM "quiz_bs" WHERE "quiz_bs"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "quiz_bs" SET "bs01" = ?, "bs02" = ?, "bs03" = ?, "bs04" = ?, "bs05" = ?, "bs06" = ?, "bscode" = ?, "updated_at" = ? WHERE "quiz_bs"."id" = ?  [["bs01", 7], ["bs02", 7], ["bs03", 7], ["bs04", 7], ["bs05", 7], ["bs06", 7], ["bscode", "777-777"], ["updated_at", "2016-04-28 19:32:57.869036"], ["id", 1]]