app/controllers/swing_books_controller.rb

    def create
      @swing_book = SwingBook.new

      @swing_book.assign_attributes(swing_book_params)
      @swing_book.user = current_user

      if @swing_book.save
---
INSERT INTO "swing_books" ("user_id", "swing_code", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["swing_code", 0], ["created_at", "2016-05-03 05:02:48.001204"], ["updated_at", "2016-05-03 05:02:48.001204"]]

    def edit
      @swing_book = SwingBook.find(params[:id])
---
SELECT  "swing_books".* FROM "swing_books" WHERE "swing_books"."id" = ? LIMIT 1  [["id", 1]]

    def update
      @swing_book = SwingBook.find(params[:id])

      @swing_book.assign_attributes(swing_book_params)

      if @swing_book.save
---
SELECT  "swing_books".* FROM "swing_books" WHERE "swing_books"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "swing_books" SET "swing01" = ?, "swing02" = ?, "swing03" = ?, "swing04" = ?, "swing05" = ?, "swing06" = ?, "swing07" = ?, "swing08" = ?, "swing09" = ?, "swing10" = ?, "swing_code" = ?, "updated_at" = ? WHERE "swing_books"."id" = ?