app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new
    @user.name = params[:user][:name]
    @user.email = params[:user][:email]
    @user.password = params[:user][:password]
    @user.password_confirmation = params[:user][:password_confirmation]

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "gender" = ?, "birthday" = ?, "dom_hand" = ?, "sport" = ?, "g_years" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["gender", "Female"], ["birthday", "1988-08-30"], ["dom_hand", "Right"], ["sport", "volleyball"], ["g_years", 0], ["updated_at", "2016-04-24 22:06:24.146128"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    @user.email = params[:user][:email]
    @user.q_bs_code = params[:user][:q_bs_code]
    @user.q_fl_code = params[:user][:q_fl_code]
    @user.q_bb_code = params[:user][:q_bb_code]
    @user.q_md_code = params[:user][:q_md_code]
    @user.gender = params[:user][:gender]
    @user.birthday = params[:user][:birthday]
    @user.dom_hand = params[:user][:dom_hand]
    @user.sport = params[:user][:sport]
    @user.g_years = params[:user][:g_years]
    @user.g_rounds = params[:user][:g_rounds]
    @user.g_practice = params[:user][:g_practice]
    @user.handicap = params[:user][:handicap]

    if @user.save